app/controllers/books_controller.rb

INSERT INTO `books` (`title`, `dsc`, `url`, `img`, `created_at`, `updated_at`) VALUES ('title1', 'dsc1', 'avatar1', 'img1', '2017-03-02 07:23:44', '2017-03-02 07:23:44')
---
	def create
	  param! :title, String, required: true
	  param! :url, String, required: true
      param! :dsc, String, required: true
	  param! :img, String, required: true

	  title = params[:title]
	  url = params[:url]
	  dsc = params[:dsc]
	  img = params[:img]

      @book = Book.new(title: title, url: url, dsc: dsc, img: img)

	  if !@book.save

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
---
	def show
		param! :id, String, required: true

		id = params[:id]

		@book = Book.find_by(id: id)

SELECT  `books`.* FROM `books` ORDER BY id desc LIMIT 10 OFFSET 0
---
    def index
		# param! :auth_token, String, required: true
	    param! :page, Integer, required: true

	    page = params[:page].to_i - 1
	    page_size = 10


        # 范围
	    if page < 0
	      return render json:{error: 4002, msg: '页码不能小于1！'}, stauts: 400
	    end

	    result_books = []

	    result_books = Book.limit(page_size).offset(page*page_size).order("id desc")