app/controllers/orders_controller.rb

INSERT INTO `orders` (`created_at`, `updated_at`, `book_id`, `status`, `user_id`) VALUES ('2017-03-02 08:25:22', '2017-03-02 08:25:22', '1', 0, '1')
---
	def create
	  param! :book_id, String, required: true
	  param! :user_id, String, required: true

	  book_id = params[:book_id]
	  user_id = params[:user_id]

      @order = Order.new(book_id: book_id, user_id: user_id, status: 0)

	  if !@order.save

SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
---
	def show
		param! :id, String, required: true

		id = params[:id]

		@order = Order.find_by(id: id)

SELECT  `orders`.* FROM `orders` ORDER BY id desc LIMIT 10 OFFSET 0
---
    def index
		# param! :auth_token, String, required: true
	    param! :page, Integer, required: true

	    page = params[:page].to_i - 1
	    page_size = 10


        # 范围
	    if page < 0
	      return render json:{error: 4002, msg: '页码不能小于1！'}, stauts: 400
	    end

	    result_orders = []

	    result_orders = Order.limit(page_size).offset(page*page_size).order("id desc")