app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `avatar`, `created_at`, `updated_at`, `auth_token`) VALUES ('aa', 'bb', '2017-03-01 16:24:29', '2017-03-01 16:24:29', 'MmkTadSRWP1yewTQBAoCK5ef')
---
	def create
	  param! :name, String, required: true
	  param! :avatar, String, required: true

	  name = params[:name]
	  avatar = params[:avatar]

      @user = User.new(name: name, avatar: avatar)
	  # @user = User.new(name: 'aa', avatar: 'bb')
	  if !@user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
	def show
		param! :id, String, required: true

		id = params[:id]

		@user = User.find_by(id: id)